function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: in
query: g.V('nm0000178').out('in')
--- result_below ---
{
  "qname": "in",
  "query": "g.V('nm0000178').out('in')",
  "result_count": 4,
  "result": [
    {
      "id": "tt0087089",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "1fc388ca-bf5a-4d55-af58-60f33650fade",
            "value": "The Cotton Club"
          }
        ]
      }
    },
    {
      "id": "tt0156812",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "ae976e2c-13f0-4a75-b3fa-59042ea24fb7",
            "value": "My Dog Skip"
          }
        ]
      }
    },
    {
      "id": "tt0250797",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "233a07bb-8780-44bc-b55a-5a17ca0dbda9",
            "value": "Unfaithful"
          }
        ]
      }
    },
    {
      "id": "tt0956038",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "2f9ea548-4e75-421f-b49e-d55bb241e398",
            "value": "Nights in Rodanthe"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_in_1520854166.json
D3Util#__init__: tmp/query_in_1520854166.json
