function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: edges
query: g.V('nm0000178').bothE()
--- result_below ---
{
  "qname": "edges",
  "query": "g.V('nm0000178').bothE()",
  "result_count": 22,
  "result": [
    {
      "id": "687bd6b7-5a0c-4163-b90f-41009bcde73d",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0087089",
      "outV": "nm0000178",
      "properties": {
        "title": "The Cotton Club"
      }
    },
    {
      "id": "06d98d5d-c6f5-45a6-96fb-0c0687c1d9a5",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0156812",
      "outV": "nm0000178",
      "properties": {
        "title": "My Dog Skip"
      }
    },
    {
      "id": "1961e65c-1a28-44b6-a175-aa608738e5ee",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0250797",
      "outV": "nm0000178",
      "properties": {
        "title": "Unfaithful"
      }
    },
    {
      "id": "a077d77f-dc31-4f83-bb09-4fcd6ef0f1d0",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0956038",
      "outV": "nm0000178",
      "properties": {
        "title": "Nights in Rodanthe"
      }
    },
    {
      "id": "f710ca79-e5f7-4591-b101-73de80a6e057",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000102",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0156812"
      }
    },
    {
      "id": "55486eb6-a711-4f1c-acee-d718cb6cfb50",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000152",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0087089|tt0250797|tt0956038"
      }
    },
    {
      "id": "5c37934f-e010-4ce4-8373-937aa45f623a",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0002138",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0087089"
      }
    },
    {
      "id": "0589fa91-2d7f-4376-a478-b4f6886b6cc9",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0005221",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0956038"
      }
    },
    {
      "id": "0ef443f6-499f-421e-a497-5702600bb75e",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0005260",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0156812"
      }
    },
    {
      "id": "7c056b8d-aab2-4d54-acfc-a4ddffb7b889",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0005561",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0156812"
      }
    },
    {
      "id": "b0f784da-1929-47e7-b185-dcf875b413ee",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0205626",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0956038"
      }
    },
    {
      "id": "2544c000-3479-4d54-a34c-f574507bf772",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0553648",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0250797"
      }
    },
    {
      "id": "6c2b03ee-fa55-4fd3-9587-afe653db90da",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0571188",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0087089"
      }
    },
    {
      "id": "d114efbc-3fd4-4b14-a829-feecce86fb71",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0838059",
      "outV": "nm0000178",
      "properties": {
        "mid_list": "tt0250797"
      }
    },
    {
      "id": "9c2a893a-925b-4272-80b6-3a4095b5dfd0",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000178",
      "outV": "nm0000102",
      "properties": {
        "mid_list": "tt0156812"
      }
    },
    {
      "id": "6e399858-c52e-4404-ac66-f713690f17dc",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000178",
      "outV": "nm0000152",
      "properties": {
        "mid_list": "tt0087089|tt0250797|tt0956038"
      }
    },
    {
      "id": "698b9dea-b209-4381-a3f1-d44f44b58bd5",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000178",
      "outV": "nm0002138",
      "properties": {
        "mid_list": "tt0087089"
      }
    },
    {
      "id": "8b0313ec-c903-4eca-855f-aee070a6f1f9",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000178",
      "outV": "nm0005221",
      "properties": {
        "mid_list": "tt0956038"
      }
    },
    {
      "id": "6bbad308-0eb1-4f77-bcce-646c5a993206",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000178",
      "outV": "nm0005260",
      "properties": {
        "mid_list": "tt0156812"
      }
    },
    {
      "id": "243510e5-3284-4db7-974b-acc08b3029d7",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000178",
      "outV": "nm0005561",
      "properties": {
        "mid_list": "tt0156812"
      }
    },
    {
      "id": "6e16bba1-3158-4991-95c4-372890d78915",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000178",
      "outV": "nm0205626",
      "properties": {
        "mid_list": "tt0956038"
      }
    },
    {
      "id": "8a18e46d-26b9-42a4-8127-edb73a4f875d",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000178",
      "outV": "nm0553648",
      "properties": {
        "mid_list": "tt0250797"
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_edges_1520854197.json
D3Util#__init__: tmp/query_edges_1520854197.json
