function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: edges
query: g.V(['n14','nm0000210']).bothE()
--- result_below ---
<gremlin_python.driver.resultset.ResultSet object at 0x101ced978>
{
  "qname": "edges",
  "query": "g.V(['n14','nm0000210']).bothE()",
  "result": [
    {
      "id": "c603afa9-b99f-42b4-8d56-e2db44048c50",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0095690",
      "outV": "nm0000210",
      "properties": {
        "title": "Mystic Pizza"
      }
    },
    {
      "id": "0588cc70-fa66-4448-88f3-e774fb0ce785",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0098384",
      "outV": "nm0000210",
      "properties": {
        "title": "Steel Magnolias"
      }
    },
    {
      "id": "199b918f-d4b6-43df-8222-8af52b0c5b67",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0099582",
      "outV": "nm0000210",
      "properties": {
        "title": "Flatliners"
      }
    },
    {
      "id": "e74d10c0-a7cf-4000-ae98-9174d650a7ac",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0100405",
      "outV": "nm0000210",
      "properties": {
        "title": "Pretty Woman"
      }
    },
    {
      "id": "dacc938e-76e1-4aaa-9fe2-825f6e8c1266",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0101787",
      "outV": "nm0000210",
      "properties": {
        "title": "Dying Young"
      }
    },
    {
      "id": "a5c1aff8-6d44-4517-8bb6-ece308696580",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0102057",
      "outV": "nm0000210",
      "properties": {
        "title": "Hook"
      }
    },
    {
      "id": "c2456bb2-aa1f-4029-9d6c-dfdb397b1782",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0102945",
      "outV": "nm0000210",
      "properties": {
        "title": "Sleeping with the Enemy"
      }
    },
    {
      "id": "0e94d03d-b6f2-4375-bb34-3a31641739d2",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0107798",
      "outV": "nm0000210",
      "properties": {
        "title": "The Pelican Brief"
      }
    },
    {
      "id": "657bf33a-29d8-47f5-a092-2d449d49e255",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0110093",
      "outV": "nm0000210",
      "properties": {
        "title": "I Love Trouble"
      }
    },
    {
      "id": "ec4f3740-b0a6-489f-aecf-e9b8e3da9ca2",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0110907",
      "outV": "nm0000210",
      "properties": {
        "title": "Ready to Wear"
      }
    },
    {
      "id": "7c21636e-059f-424b-aa34-6624c70190b5",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0114496",
      "outV": "nm0000210",
      "properties": {
        "title": "Something to Talk About"
      }
    },
    {
      "id": "4f15a15f-5f56-41da-8d36-3b69a856dae8",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0116242",
      "outV": "nm0000210",
      "properties": {
        "title": "Everyone Says I Love You"
      }
    },
    {
      "id": "69659162-2b61-4fde-b9a4-d040eb53ef89",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0117002",
      "outV": "nm0000210",
      "properties": {
        "title": "Mary Reilly"
      }
    },
    {
      "id": "fcf4bd15-d534-4c2a-8421-02c0ca7f93e1",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0117039",
      "outV": "nm0000210",
      "properties": {
        "title": "Michael Collins"
      }
    },
    {
      "id": "b72f904e-f69c-4314-b26d-6290f341a724",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0118883",
      "outV": "nm0000210",
      "properties": {
        "title": "Conspiracy Theory"
      }
    },
    {
      "id": "33d7d04d-d9ad-48d2-bf6e-4839fe333480",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0119738",
      "outV": "nm0000210",
      "properties": {
        "title": "My Best Friends Wedding"
      }
    },
    {
      "id": "4d75a0c6-0dd4-4cf8-b681-6ed1c619edb0",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0120686",
      "outV": "nm0000210",
      "properties": {
        "title": "Stepmom"
      }
    },
    {
      "id": "6c789484-275f-4109-8bed-b70b75a72551",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0125439",
      "outV": "nm0000210",
      "properties": {
        "title": "Notting Hill"
      }
    },
    {
      "id": "5ba68bad-2c38-4d82-81d6-fb3eebdfeafb",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0163187",
      "outV": "nm0000210",
      "properties": {
        "title": "Runaway Bride"
      }
    },
    {
      "id": "5bed107e-57c2-4cb4-8a7e-0b100794599b",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0195685",
      "outV": "nm0000210",
      "properties": {
        "title": "Erin Brockovich"
      }
    },
    {
      "id": "529e635a-11ac-4753-8788-f5070bfbc253",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0236493",
      "outV": "nm0000210",
      "properties": {
        "title": "The Mexican"
      }
    },
    {
      "id": "956830a6-1577-419c-acab-80052eb1d973",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0240772",
      "outV": "nm0000210",
      "properties": {
        "title": "Oceans Eleven"
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_edges_1521022675.json
D3Util#__init__: tmp/query_edges_1521022675.json
