function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: knows
query: g.V(['n14','nm0000210']).out('knows')
--- result_below ---
{
  "qname": "knows",
  "query": "g.V(['n14','nm0000210']).out('knows')",
  "id1": "nm0000210",
  "pk1": "n14",
  "result_count": 22,
  "result": [
    {
      "id": "nm0000047",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000047|pk",
            "value": "n6"
          }
        ],
        "name": [
          {
            "id": "fe8f6046-9208-4f4f-8fad-c2bb84290238",
            "value": "Sophia Loren"
          }
        ]
      }
    },
    {
      "id": "nm0000052",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000052|pk",
            "value": "n7"
          }
        ],
        "name": [
          {
            "id": "28b5da99-7ba5-4bcc-ae40-532fd06ea5f0",
            "value": "Marcello Mastroianni"
          }
        ]
      }
    },
    {
      "id": "nm0000093",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000093|pk",
            "value": "n9"
          }
        ],
        "name": [
          {
            "id": "aeedb60c-2a37-4980-af99-77ca1e829c7e",
            "value": "Brad Pitt"
          }
        ]
      }
    },
    {
      "id": "nm0000095",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000095|pk",
            "value": "n9"
          }
        ],
        "name": [
          {
            "id": "24c23b7c-32b1-4410-bc5e-b20675fe6cf1",
            "value": "Woody Allen"
          }
        ]
      }
    },
    {
      "id": "nm0000098",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000098|pk",
            "value": "n9"
          }
        ],
        "name": [
          {
            "id": "5370e7f0-c46b-4982-94dd-ad080cbede64",
            "value": "Jennifer Aniston"
          }
        ]
      }
    },
    {
      "id": "nm0000102",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000102|pk",
            "value": "n10"
          }
        ],
        "name": [
          {
            "id": "c48051a9-c722-48f0-abbe-1f3ccf122b14",
            "value": "Kevin Bacon"
          }
        ]
      }
    },
    {
      "id": "nm0000106",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000106|pk",
            "value": "n10"
          }
        ],
        "name": [
          {
            "id": "26fffa87-4909-4de6-bfaf-2912844801c4",
            "value": "Drew Barrymore"
          }
        ]
      }
    },
    {
      "id": "nm0000114",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000114|pk",
            "value": "n10"
          }
        ],
        "name": [
          {
            "id": "7b2de26d-1cde-466a-8f6b-52e691f35ee0",
            "value": "Steve Buscemi"
          }
        ]
      }
    },
    {
      "id": "nm0000115",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000115|pk",
            "value": "n10"
          }
        ],
        "name": [
          {
            "id": "ff40a7b9-838a-4276-adcf-8da6d6cf7cfc",
            "value": "Nicolas Cage"
          }
        ]
      }
    },
    {
      "id": "nm0000123",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000123|pk",
            "value": "n11"
          }
        ],
        "name": [
          {
            "id": "8c781557-8ecf-49f0-93a7-bafef761525e",
            "value": "George Clooney"
          }
        ]
      }
    },
    {
      "id": "nm0000131",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000131|pk",
            "value": "n11"
          }
        ],
        "name": [
          {
            "id": "3e422103-1497-4a7e-b31c-10af8b4cd8ee",
            "value": "John Cusack"
          }
        ]
      }
    },
    {
      "id": "nm0000139",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000139|pk",
            "value": "n11"
          }
        ],
        "name": [
          {
            "id": "57f51332-c530-44ef-b568-3cb23e1047a2",
            "value": "Cameron Diaz"
          }
        ]
      }
    },
    {
      "id": "nm0000141",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000141|pk",
            "value": "n11"
          }
        ],
        "name": [
          {
            "id": "5a650e84-df72-4199-b86c-8efb33b0c8b5",
            "value": "David Duchovny"
          }
        ]
      }
    },
    {
      "id": "nm0000152",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000152|pk",
            "value": "n12"
          }
        ],
        "name": [
          {
            "id": "069b03ee-c460-4c42-be40-0a39470c6106",
            "value": "Richard Gere"
          }
        ]
      }
    },
    {
      "id": "nm0000154",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000154|pk",
            "value": "n12"
          }
        ],
        "name": [
          {
            "id": "9bde4f1b-3ec5-4b86-8306-c55983f64140",
            "value": "Mel Gibson"
          }
        ]
      }
    },
    {
      "id": "nm0000158",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000158|pk",
            "value": "n12"
          }
        ],
        "name": [
          {
            "id": "551644a9-df4e-4625-86b6-fd95fded6960",
            "value": "Tom Hanks"
          }
        ]
      }
    },
    {
      "id": "nm0000163",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000163|pk",
            "value": "n12"
          }
        ],
        "name": [
          {
            "id": "cca1797e-3051-4364-8230-8af68de4d370",
            "value": "Dustin Hoffman"
          }
        ]
      }
    },
    {
      "id": "nm0000173",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000173|pk",
            "value": "n13"
          }
        ],
        "name": [
          {
            "id": "2b24989a-0dbd-4f1e-b64a-b98dca9d69bf",
            "value": "Nicole Kidman"
          }
        ]
      }
    },
    {
      "id": "nm0000179",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000179|pk",
            "value": "n13"
          }
        ],
        "name": [
          {
            "id": "a9982663-b115-4487-9aac-c01e3fd9e5fa",
            "value": "Jude Law"
          }
        ]
      }
    },
    {
      "id": "nm0000204",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000204|pk",
            "value": "n14"
          }
        ],
        "name": [
          {
            "id": "4d01db04-af8a-4f0d-adbc-2ff114ca61be",
            "value": "Natalie Portman"
          }
        ]
      }
    },
    {
      "id": "nm0000215",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000215|pk",
            "value": "n14"
          }
        ],
        "name": [
          {
            "id": "744532bc-5e05-4ec9-8b9c-c3b74885cc21",
            "value": "Susan Sarandon"
          }
        ]
      }
    },
    {
      "id": "nm0000243",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000243|pk",
            "value": "n15"
          }
        ],
        "name": [
          {
            "id": "cdd9019b-32a5-4ab5-a5e9-bcc1da5aa942",
            "value": "Denzel Washington"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_knows_1521024705.json
D3Util#__init__: tmp/query_knows_1521024705.json
