function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: in
query: g.V(['n14','nm0000210']).out('in')
--- result_below ---
{
  "qname": "in",
  "query": "g.V(['n14','nm0000210']).out('in')",
  "id1": "nm0000210",
  "pk1": "n14",
  "result_count": 22,
  "result": [
    {
      "id": "tt0095690",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0095690|pk",
            "value": "t309"
          }
        ],
        "title": [
          {
            "id": "7c074516-a69f-4e62-a792-478c2ef3c86b",
            "value": "Mystic Pizza"
          }
        ]
      }
    },
    {
      "id": "tt0098384",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0098384|pk",
            "value": "t313"
          }
        ],
        "title": [
          {
            "id": "818c5b25-e520-47f1-a5a3-4f49ef43e294",
            "value": "Steel Magnolias"
          }
        ]
      }
    },
    {
      "id": "tt0099582",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0099582|pk",
            "value": "t315"
          }
        ],
        "title": [
          {
            "id": "232328e7-07a5-4df9-9179-8496d83b31d8",
            "value": "Flatliners"
          }
        ]
      }
    },
    {
      "id": "tt0100405",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0100405|pk",
            "value": "t316"
          }
        ],
        "title": [
          {
            "id": "2d18c28c-9296-4cdc-a10f-0cbf24c99531",
            "value": "Pretty Woman"
          }
        ]
      }
    },
    {
      "id": "tt0101787",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0101787|pk",
            "value": "t319"
          }
        ],
        "title": [
          {
            "id": "93625e0b-bd10-449e-8371-feb9da5cbb47",
            "value": "Dying Young"
          }
        ]
      }
    },
    {
      "id": "tt0102057",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0102057|pk",
            "value": "t319"
          }
        ],
        "title": [
          {
            "id": "cf06af50-dc68-422d-a14d-0e114b3044be",
            "value": "Hook"
          }
        ]
      }
    },
    {
      "id": "tt0102945",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0102945|pk",
            "value": "t320"
          }
        ],
        "title": [
          {
            "id": "58984e76-7e88-40bb-9c49-328fd3e1e2d8",
            "value": "Sleeping with the Enemy"
          }
        ]
      }
    },
    {
      "id": "tt0107798",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0107798|pk",
            "value": "t328"
          }
        ],
        "title": [
          {
            "id": "2cac11c5-f094-439d-9dbf-da41733ba3cd",
            "value": "The Pelican Brief"
          }
        ]
      }
    },
    {
      "id": "tt0110093",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0110093|pk",
            "value": "t331"
          }
        ],
        "title": [
          {
            "id": "bccce392-5cac-4bc5-abe1-a009716cd76d",
            "value": "I Love Trouble"
          }
        ]
      }
    },
    {
      "id": "tt0110907",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0110907|pk",
            "value": "t333"
          }
        ],
        "title": [
          {
            "id": "836a1f0a-8d7f-4d4f-828d-35b4bfa000f9",
            "value": "Ready to Wear"
          }
        ]
      }
    },
    {
      "id": "tt0114496",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0114496|pk",
            "value": "t338"
          }
        ],
        "title": [
          {
            "id": "87c80b52-d531-453c-b114-73ebb8234285",
            "value": "Something to Talk About"
          }
        ]
      }
    },
    {
      "id": "tt0116242",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0116242|pk",
            "value": "t340"
          }
        ],
        "title": [
          {
            "id": "8d1d8532-8fef-4524-aae6-a78719402018",
            "value": "Everyone Says I Love You"
          }
        ]
      }
    },
    {
      "id": "tt0117002",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0117002|pk",
            "value": "t342"
          }
        ],
        "title": [
          {
            "id": "b50a273d-79f7-4c5e-9a39-f08771858fec",
            "value": "Mary Reilly"
          }
        ]
      }
    },
    {
      "id": "tt0117039",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0117039|pk",
            "value": "t342"
          }
        ],
        "title": [
          {
            "id": "dcea225a-b672-4e9c-8470-220910b9d211",
            "value": "Michael Collins"
          }
        ]
      }
    },
    {
      "id": "tt0118883",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0118883|pk",
            "value": "t344"
          }
        ],
        "title": [
          {
            "id": "ed1aaf99-9c11-4b42-9492-deb6d65b768e",
            "value": "Conspiracy Theory"
          }
        ]
      }
    },
    {
      "id": "tt0119738",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0119738|pk",
            "value": "t346"
          }
        ],
        "title": [
          {
            "id": "bc86f4f4-408c-4878-a27a-aae4493b179f",
            "value": "My Best Friends Wedding"
          }
        ]
      }
    },
    {
      "id": "tt0120686",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0120686|pk",
            "value": "t347"
          }
        ],
        "title": [
          {
            "id": "096c68eb-a8bb-4514-8a73-c4d16d27c728",
            "value": "Stepmom"
          }
        ]
      }
    },
    {
      "id": "tt0125439",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0125439|pk",
            "value": "t354"
          }
        ],
        "title": [
          {
            "id": "0f4f26cc-0e85-43a1-bf41-cfd01df50105",
            "value": "Notting Hill"
          }
        ]
      }
    },
    {
      "id": "tt0163187",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0163187|pk",
            "value": "t403"
          }
        ],
        "title": [
          {
            "id": "e74dacbf-ce1b-4364-b483-c501c4a29a5d",
            "value": "Runaway Bride"
          }
        ]
      }
    },
    {
      "id": "tt0195685",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0195685|pk",
            "value": "t442"
          }
        ],
        "title": [
          {
            "id": "d2932833-a21c-4ee7-8ff6-a0539e801f1c",
            "value": "Erin Brockovich"
          }
        ]
      }
    },
    {
      "id": "tt0236493",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0236493|pk",
            "value": "t486"
          }
        ],
        "title": [
          {
            "id": "b7a8918d-ed07-432b-bfc9-854003c42c8b",
            "value": "The Mexican"
          }
        ]
      }
    },
    {
      "id": "tt0240772",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0240772|pk",
            "value": "t490"
          }
        ],
        "title": [
          {
            "id": "c9e904f0-5764-4896-a061-7b5c00abfb0e",
            "value": "Oceans Eleven"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_in_1521024671.json
D3Util#__init__: tmp/query_in_1521024671.json
