function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: edges
query: g.V(['n10','nm0000102']).bothE()
--- result_below ---
<gremlin_python.driver.resultset.ResultSet object at 0x10329e940>
{
  "qname": "edges",
  "query": "g.V(['n10','nm0000102']).bothE()",
  "result": [
    {
      "id": "2dc23536-3e48-4330-8055-9bb1679df250",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0087277",
      "outV": "nm0000102",
      "properties": {
        "title": "Footloose"
      }
    },
    {
      "id": "2cf0ef87-f74d-4f4c-ac33-d4d903325c69",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0091814",
      "outV": "nm0000102",
      "properties": {
        "title": "Quicksilver"
      }
    },
    {
      "id": "3a8df865-1f46-4e87-86a3-505832bc6c86",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0092967",
      "outV": "nm0000102",
      "properties": {
        "title": "End of the Line"
      }
    },
    {
      "id": "f291973e-7ff1-487d-8748-d051f0a8ff98",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0093403",
      "outV": "nm0000102",
      "properties": {
        "title": "Lemon Sky"
      }
    },
    {
      "id": "aceda8b8-2b69-426f-a16b-51b30ec8c730",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0094318",
      "outV": "nm0000102",
      "properties": {
        "title": "White Water Summer"
      }
    },
    {
      "id": "a41920c5-7de2-4038-af5f-b9bab5904c92",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0096094",
      "outV": "nm0000102",
      "properties": {
        "title": "Shes Having a Baby"
      }
    },
    {
      "id": "59b14bb0-6d9b-4d43-8376-d3a44256f037",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0096926",
      "outV": "nm0000102",
      "properties": {
        "title": "The Big Picture"
      }
    },
    {
      "id": "4b2b6377-0558-4102-8086-f298ac34e3bb",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0097125",
      "outV": "nm0000102",
      "properties": {
        "title": "Criminal Law"
      }
    },
    {
      "id": "09e52f89-4f94-4c54-8a24-977c4926215e",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0099582",
      "outV": "nm0000102",
      "properties": {
        "title": "Flatliners"
      }
    },
    {
      "id": "94e9e0b6-dcfe-4728-ac53-a1096a6670ed",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0100814",
      "outV": "nm0000102",
      "properties": {
        "title": "Tremors"
      }
    },
    {
      "id": "2843ab09-b232-4997-afe7-8bb0d9a8a041",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0102011",
      "outV": "nm0000102",
      "properties": {
        "title": "He Said, She Said"
      }
    },
    {
      "id": "c5d70f2e-9d75-4e12-9e31-2d818f831bf3",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0102733",
      "outV": "nm0000102",
      "properties": {
        "title": "Pyrates"
      }
    },
    {
      "id": "c90ddb2e-7279-4e24-b3e4-27766006709c",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0102741",
      "outV": "nm0000102",
      "properties": {
        "title": "Queens Logic"
      }
    },
    {
      "id": "de7984b8-c60f-4886-b46c-a8ba2127c51e",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0104257",
      "outV": "nm0000102",
      "properties": {
        "title": "A Few Good Men"
      }
    },
    {
      "id": "ac59e386-b415-464b-a76c-7ae7f87eb5d8",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0109067",
      "outV": "nm0000102",
      "properties": {
        "title": "The Air Up There"
      }
    },
    {
      "id": "70e73cbf-e8cd-467d-88b7-3919be9d1543",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0110997",
      "outV": "nm0000102",
      "properties": {
        "title": "The River Wild"
      }
    },
    {
      "id": "0f23096d-9e5e-4a03-86ef-e045e3734f1d",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0112384",
      "outV": "nm0000102",
      "properties": {
        "title": "Apollo 13"
      }
    },
    {
      "id": "bb42ada8-30c1-47b0-9667-2ae1fcc8813d",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0112453",
      "outV": "nm0000102",
      "properties": {
        "title": "Balto"
      }
    },
    {
      "id": "b06218bf-1e4a-44f2-95cc-74f7fc6f6c9c",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0113870",
      "outV": "nm0000102",
      "properties": {
        "title": "Murder in the First"
      }
    },
    {
      "id": "fe29fe5a-d30b-4e21-8c48-d8738d8b95f0",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0117665",
      "outV": "nm0000102",
      "properties": {
        "title": "Sleepers"
      }
    },
    {
      "id": "c8abca16-adae-407b-8a90-076ce64d69cd",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0118980",
      "outV": "nm0000102",
      "properties": {
        "title": "Digging to China"
      }
    },
    {
      "id": "938e072e-f335-47b5-ae61-7e33954ff5d3",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0119896",
      "outV": "nm0000102",
      "properties": {
        "title": "Picture Perfect"
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_edges_1521022894.json
D3Util#__init__: tmp/query_edges_1521022894.json
