function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: knows
query: g.V(['n10','nm0000102']).out('knows')
--- result_below ---
{
  "qname": "knows",
  "query": "g.V(['n10','nm0000102']).out('knows')",
  "id1": "nm0000102",
  "pk1": "n10",
  "result_count": 22,
  "result": [
    {
      "id": "nm0000093",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000093|pk",
            "value": "n9"
          }
        ],
        "name": [
          {
            "id": "aeedb60c-2a37-4980-af99-77ca1e829c7e",
            "value": "Brad Pitt"
          }
        ]
      }
    },
    {
      "id": "nm0000098",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000098|pk",
            "value": "n9"
          }
        ],
        "name": [
          {
            "id": "5370e7f0-c46b-4982-94dd-ad080cbede64",
            "value": "Jennifer Aniston"
          }
        ]
      }
    },
    {
      "id": "nm0000117",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000117|pk",
            "value": "n10"
          }
        ],
        "name": [
          {
            "id": "14d49a55-7079-4014-b5eb-71ab6fc5c0b4",
            "value": "Neve Campbell"
          }
        ]
      }
    },
    {
      "id": "nm0000129",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000129|pk",
            "value": "n11"
          }
        ],
        "name": [
          {
            "id": "5dab621e-a609-47f3-9303-de4a9fc26001",
            "value": "Tom Cruise"
          }
        ]
      }
    },
    {
      "id": "nm0000134",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000134|pk",
            "value": "n11"
          }
        ],
        "name": [
          {
            "id": "de4cc98a-d436-4cf5-816b-136177d8ad78",
            "value": "Robert De Niro"
          }
        ]
      }
    },
    {
      "id": "nm0000147",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000147|pk",
            "value": "n12"
          }
        ],
        "name": [
          {
            "id": "24ddddc0-8f3e-46b3-8148-8d389f461217",
            "value": "Colin Firth"
          }
        ]
      }
    },
    {
      "id": "nm0000158",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000158|pk",
            "value": "n12"
          }
        ],
        "name": [
          {
            "id": "551644a9-df4e-4625-86b6-fd95fded6960",
            "value": "Tom Hanks"
          }
        ]
      }
    },
    {
      "id": "nm0000178",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000178|pk",
            "value": "n13"
          }
        ],
        "name": [
          {
            "id": "e77785e7-7686-4062-96b5-090e40634fc9",
            "value": "Diane Lane"
          }
        ]
      }
    },
    {
      "id": "nm0000193",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000193|pk",
            "value": "n13"
          }
        ],
        "name": [
          {
            "id": "fe667237-1b61-4da5-bca4-1c191d08d57d",
            "value": "Demi Moore"
          }
        ]
      }
    },
    {
      "id": "nm0000197",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000197|pk",
            "value": "n14"
          }
        ],
        "name": [
          {
            "id": "2a5c7e4a-9442-42b0-8cac-a9606cc1cd2a",
            "value": "Jack Nicholson"
          }
        ]
      }
    },
    {
      "id": "nm0000198",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000198|pk",
            "value": "n14"
          }
        ],
        "name": [
          {
            "id": "fe299291-075d-489a-9cf8-5cc297c45524",
            "value": "Gary Oldman"
          }
        ]
      }
    },
    {
      "id": "nm0000200",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000200|pk",
            "value": "n14"
          }
        ],
        "name": [
          {
            "id": "b4cfafcc-5b18-47f8-994c-3e63dbe1b211",
            "value": "Bill Paxton"
          }
        ]
      }
    },
    {
      "id": "nm0000209",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000209|pk",
            "value": "n14"
          }
        ],
        "name": [
          {
            "id": "151e3914-4bcc-4b0b-8ce2-1ac3b7f44403",
            "value": "Tim Robbins"
          }
        ]
      }
    },
    {
      "id": "nm0000210",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000210|pk",
            "value": "n14"
          }
        ],
        "name": [
          {
            "id": "a3681a09-4e36-4435-bc99-8e4d7dfd855e",
            "value": "Julia Roberts"
          }
        ]
      }
    },
    {
      "id": "nm0000223",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000223|pk",
            "value": "n14"
          }
        ],
        "name": [
          {
            "id": "9b02848d-4c36-474d-ad62-7f71f73bb03e",
            "value": "Elisabeth Shue"
          }
        ]
      }
    },
    {
      "id": "nm0000225",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000225|pk",
            "value": "n15"
          }
        ],
        "name": [
          {
            "id": "a2890c42-a938-45b0-9f56-dd0c0654cbf6",
            "value": "Christian Slater"
          }
        ]
      }
    },
    {
      "id": "nm0000234",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000234|pk",
            "value": "n15"
          }
        ],
        "name": [
          {
            "id": "6b58258f-c037-4ef8-91b1-a4fe57f08eaf",
            "value": "Charlize Theron"
          }
        ]
      }
    },
    {
      "id": "nm0000239",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000239|pk",
            "value": "n15"
          }
        ],
        "name": [
          {
            "id": "ff1e567c-9a9c-42c2-88f7-8ece4ddc8b22",
            "value": "Liv Tyler"
          }
        ]
      }
    },
    {
      "id": "nm0000250",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000250|pk",
            "value": "n15"
          }
        ],
        "name": [
          {
            "id": "4dd5a913-b293-42b6-b72c-57586af08668",
            "value": "Ren\u00e9e Zellweger"
          }
        ]
      }
    },
    {
      "id": "nm0000276",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000276|pk",
            "value": "n16"
          }
        ],
        "name": [
          {
            "id": "c87a83b6-a51f-4745-a393-c81d988264fe",
            "value": "Sean Astin"
          }
        ]
      }
    },
    {
      "id": "nm0000285",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000285|pk",
            "value": "n16"
          }
        ],
        "name": [
          {
            "id": "f898a22b-bb67-437d-98c0-0c3daff67b25",
            "value": "Alec Baldwin"
          }
        ]
      }
    },
    {
      "id": "nm0000287",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000287|pk",
            "value": "n16"
          }
        ],
        "name": [
          {
            "id": "42d3db2e-e8bb-46a0-b6f5-e0783617793e",
            "value": "William Baldwin"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_knows_1521024699.json
D3Util#__init__: tmp/query_knows_1521024699.json
