function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: in
query: g.V('nm0000102').out('in')
--- result_below ---
{
  "qname": "in",
  "query": "g.V('nm0000102').out('in')",
  "result_count": 29,
  "result": [
    {
      "id": "tt0087277",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "50386697-2885-43e8-a9d3-d43a48c646dc",
            "value": "Footloose"
          }
        ]
      }
    },
    {
      "id": "tt0091814",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "93d78aac-df8d-4d48-90ed-565680336434",
            "value": "Quicksilver"
          }
        ]
      }
    },
    {
      "id": "tt0092967",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "ba2507b5-7297-463d-8644-bf3738a0b853",
            "value": "End of the Line"
          }
        ]
      }
    },
    {
      "id": "tt0093403",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "f6b41187-51dd-4d39-866a-eec36ddece4d",
            "value": "Lemon Sky"
          }
        ]
      }
    },
    {
      "id": "tt0094318",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "53789095-0c0b-4c4a-8b8d-0cfee735bbeb",
            "value": "White Water Summer"
          }
        ]
      }
    },
    {
      "id": "tt0096094",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "79e4e869-d0e8-42b1-9658-c120844dba39",
            "value": "Shes Having a Baby"
          }
        ]
      }
    },
    {
      "id": "tt0096926",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "64f19734-4f45-4f75-9e63-642989b91b62",
            "value": "The Big Picture"
          }
        ]
      }
    },
    {
      "id": "tt0097125",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "717f009f-9dcc-4f26-9338-f55f6493be7d",
            "value": "Criminal Law"
          }
        ]
      }
    },
    {
      "id": "tt0099582",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "e3f05b56-fb55-47b8-b9f3-830427155954",
            "value": "Flatliners"
          }
        ]
      }
    },
    {
      "id": "tt0100814",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "25385f8b-b918-4c68-b126-07c029c2b71f",
            "value": "Tremors"
          }
        ]
      }
    },
    {
      "id": "tt0102011",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "25afa834-296f-4337-b1d5-9ef59cc5836c",
            "value": "He Said, She Said"
          }
        ]
      }
    },
    {
      "id": "tt0102733",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "237f1716-bc34-4a23-8535-82c4e1f4c0a8",
            "value": "Pyrates"
          }
        ]
      }
    },
    {
      "id": "tt0102741",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "fe8bb3ed-fcb2-425b-ac23-6c6e1d58a4d7",
            "value": "Queens Logic"
          }
        ]
      }
    },
    {
      "id": "tt0104257",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "49847537-7b63-4d99-bd48-abd954278ef2",
            "value": "A Few Good Men"
          }
        ]
      }
    },
    {
      "id": "tt0109067",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "63efc639-1003-4b6c-a2cf-5532725fc116",
            "value": "The Air Up There"
          }
        ]
      }
    },
    {
      "id": "tt0110997",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "93fafac6-0008-4e75-a0f6-a7ea59564047",
            "value": "The River Wild"
          }
        ]
      }
    },
    {
      "id": "tt0112384",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "b3bddd35-09a2-4a81-8482-c5b955f6b8f7",
            "value": "Apollo 13"
          }
        ]
      }
    },
    {
      "id": "tt0112453",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "4f1b35ef-430b-4174-99bd-9735282358dd",
            "value": "Balto"
          }
        ]
      }
    },
    {
      "id": "tt0113870",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "4bc3ff9e-ccb2-42aa-bcaf-1010c5990d34",
            "value": "Murder in the First"
          }
        ]
      }
    },
    {
      "id": "tt0117665",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "1a98280a-67eb-495b-b096-835e4a439a9f",
            "value": "Sleepers"
          }
        ]
      }
    },
    {
      "id": "tt0118980",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "95c7afc4-c631-40e3-9f9f-f83c9547bae6",
            "value": "Digging to China"
          }
        ]
      }
    },
    {
      "id": "tt0119896",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "66f10328-6f6c-4075-8dbe-0ff65f38495b",
            "value": "Picture Perfect"
          }
        ]
      }
    },
    {
      "id": "tt0120303",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "52657561-edec-4995-a093-cf5de8b4068b",
            "value": "Telling Lies in America"
          }
        ]
      }
    },
    {
      "id": "tt0120890",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "e4a33b06-cb77-433f-ac20-9f519a597848",
            "value": "Wild Things"
          }
        ]
      }
    },
    {
      "id": "tt0123191",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "d74e8eaf-251b-4c01-8dd6-b70f132b29a0",
            "value": "New York Skyride"
          }
        ]
      }
    },
    {
      "id": "tt0156812",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "ae976e2c-13f0-4a75-b3fa-59042ea24fb7",
            "value": "My Dog Skip"
          }
        ]
      }
    },
    {
      "id": "tt0164052",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "01382785-cccc-4199-a346-d3e1b04537f7",
            "value": "Hollow Man"
          }
        ]
      }
    },
    {
      "id": "tt0164181",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "bd4bfb81-f516-4a6b-be49-e0b119848c38",
            "value": "Stir of Echoes"
          }
        ]
      }
    },
    {
      "id": "tt0280380",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "453a65e9-c84e-4db6-ae47-f97bcdb7633f",
            "value": "Trapped"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_in_1520854148.json
D3Util#__init__: tmp/query_in_1520854148.json
