function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: in
query: g.V(['n10','nm0000102']).out('in')
--- result_below ---
<gremlin_python.driver.resultset.ResultSet object at 0x104a74978>
{
  "qname": "in",
  "query": "g.V(['n10','nm0000102']).out('in')",
  "result": [
    {
      "id": "tt0087277",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0087277|pk",
            "value": "t295"
          }
        ],
        "title": [
          {
            "id": "906d0e7f-cfb5-4d43-b547-5cc8c859b359",
            "value": "Footloose"
          }
        ]
      }
    },
    {
      "id": "tt0091814",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0091814|pk",
            "value": "t303"
          }
        ],
        "title": [
          {
            "id": "e49cf3c1-81cc-49bf-9232-c63b76dc5ccf",
            "value": "Quicksilver"
          }
        ]
      }
    },
    {
      "id": "tt0092967",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0092967|pk",
            "value": "t304"
          }
        ],
        "title": [
          {
            "id": "f0719bdb-91af-4a9d-8191-9c80c531013a",
            "value": "End of the Line"
          }
        ]
      }
    },
    {
      "id": "tt0093403",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0093403|pk",
            "value": "t305"
          }
        ],
        "title": [
          {
            "id": "b3b70b54-d929-4507-8c62-311aef59cf54",
            "value": "Lemon Sky"
          }
        ]
      }
    },
    {
      "id": "tt0094318",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0094318|pk",
            "value": "t307"
          }
        ],
        "title": [
          {
            "id": "70d2c2b6-c9d0-402c-a8b8-ffea9351e161",
            "value": "White Water Summer"
          }
        ]
      }
    },
    {
      "id": "tt0096094",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0096094|pk",
            "value": "t309"
          }
        ],
        "title": [
          {
            "id": "9c5e98bb-6f88-4cce-ba2c-0a89581368c4",
            "value": "Shes Having a Baby"
          }
        ]
      }
    },
    {
      "id": "tt0096926",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0096926|pk",
            "value": "t311"
          }
        ],
        "title": [
          {
            "id": "e2a9fe5a-90f5-4b80-8510-110200c0b133",
            "value": "The Big Picture"
          }
        ]
      }
    },
    {
      "id": "tt0097125",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0097125|pk",
            "value": "t311"
          }
        ],
        "title": [
          {
            "id": "c30f97ae-0a94-4287-beda-75fbcd7b0272",
            "value": "Criminal Law"
          }
        ]
      }
    },
    {
      "id": "tt0099582",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0099582|pk",
            "value": "t315"
          }
        ],
        "title": [
          {
            "id": "232328e7-07a5-4df9-9179-8496d83b31d8",
            "value": "Flatliners"
          }
        ]
      }
    },
    {
      "id": "tt0100814",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0100814|pk",
            "value": "t317"
          }
        ],
        "title": [
          {
            "id": "b5cfe415-eaa8-4a02-8e5d-1e5ee0a76dbc",
            "value": "Tremors"
          }
        ]
      }
    },
    {
      "id": "tt0102011",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0102011|pk",
            "value": "t319"
          }
        ],
        "title": [
          {
            "id": "675033e3-2012-4d1d-a96c-6b28e3df863c",
            "value": "He Said, She Said"
          }
        ]
      }
    },
    {
      "id": "tt0102733",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0102733|pk",
            "value": "t320"
          }
        ],
        "title": [
          {
            "id": "685d8a39-08f9-41fc-8bbe-3d08eb30c28b",
            "value": "Pyrates"
          }
        ]
      }
    },
    {
      "id": "tt0102741",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0102741|pk",
            "value": "t320"
          }
        ],
        "title": [
          {
            "id": "8bf11564-e11c-4270-8038-305a1cbcc6be",
            "value": "Queens Logic"
          }
        ]
      }
    },
    {
      "id": "tt0104257",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0104257|pk",
            "value": "t322"
          }
        ],
        "title": [
          {
            "id": "04ff3888-abb0-4588-b920-9da08b3471f1",
            "value": "A Few Good Men"
          }
        ]
      }
    },
    {
      "id": "tt0109067",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0109067|pk",
            "value": "t330"
          }
        ],
        "title": [
          {
            "id": "5721ab32-bc5f-45dd-b195-1e212e4ecb37",
            "value": "The Air Up There"
          }
        ]
      }
    },
    {
      "id": "tt0110997",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0110997|pk",
            "value": "t333"
          }
        ],
        "title": [
          {
            "id": "4c577100-6d7b-448b-99c6-731663d70659",
            "value": "The River Wild"
          }
        ]
      }
    },
    {
      "id": "tt0112384",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0112384|pk",
            "value": "t335"
          }
        ],
        "title": [
          {
            "id": "363e4ed1-83a9-4aff-a95f-c65c45465057",
            "value": "Apollo 13"
          }
        ]
      }
    },
    {
      "id": "tt0112453",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0112453|pk",
            "value": "t335"
          }
        ],
        "title": [
          {
            "id": "dfc855e2-71c0-4b59-bdb2-92e3f04f4ff2",
            "value": "Balto"
          }
        ]
      }
    },
    {
      "id": "tt0113870",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0113870|pk",
            "value": "t337"
          }
        ],
        "title": [
          {
            "id": "6734a15d-8ca6-47c4-beb7-a00a08cc1a0f",
            "value": "Murder in the First"
          }
        ]
      }
    },
    {
      "id": "tt0117665",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0117665|pk",
            "value": "t343"
          }
        ],
        "title": [
          {
            "id": "6a56eced-5307-49dc-ad99-3abad0192399",
            "value": "Sleepers"
          }
        ]
      }
    },
    {
      "id": "tt0118980",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0118980|pk",
            "value": "t344"
          }
        ],
        "title": [
          {
            "id": "a4d7a400-9252-4d56-9846-1f65929fc54b",
            "value": "Digging to China"
          }
        ]
      }
    },
    {
      "id": "tt0119896",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0119896|pk",
            "value": "t346"
          }
        ],
        "title": [
          {
            "id": "80d3ddaa-c6f0-4488-bea2-c23fb68c515d",
            "value": "Picture Perfect"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_in_1521022654.json
D3Util#__init__: tmp/query_in_1521022654.json
