function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: in
query: g.V(['n41','nm0001742']).out('in')
--- result_below ---
{
  "qname": "in",
  "query": "g.V(['n41','nm0001742']).out('in')",
  "id1": "nm0001742",
  "pk1": "n41",
  "result_count": 2,
  "result": [
    {
      "id": "tt0087277",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0087277|pk",
            "value": "t295"
          }
        ],
        "title": [
          {
            "id": "906d0e7f-cfb5-4d43-b547-5cc8c859b359",
            "value": "Footloose"
          }
        ]
      }
    },
    {
      "id": "tt0089543",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "tt0089543|pk",
            "value": "t299"
          }
        ],
        "title": [
          {
            "id": "358521a1-81cc-41ce-a53b-67410321f5ae",
            "value": "The Man with One Red Shoe"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_in_1521024677.json
D3Util#__init__: tmp/query_in_1521024677.json
