function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: edges
query: g.V('nm0001742').bothE()
--- result_below ---
{
  "qname": "edges",
  "query": "g.V('nm0001742').bothE()",
  "result_count": 14,
  "result": [
    {
      "id": "a01d9ef6-b8e1-4ca3-8558-2714a86dc91c",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0087277",
      "outV": "nm0001742",
      "properties": {
        "title": "Footloose"
      }
    },
    {
      "id": "e5ba26aa-d007-436d-becd-c9d23bdc33a5",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0089543",
      "outV": "nm0001742",
      "properties": {
        "title": "The Man with One Red Shoe"
      }
    },
    {
      "id": "6478082c-8c80-4830-90d5-f98e2699a91a",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000102",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "6ae084a0-8589-4a27-a8f2-aca570d52c6a",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000158",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "1c9930b6-6b5a-4184-9661-c40cdf40c214",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001056",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "b22d50bf-2277-4035-be25-04ccf7b6b4d1",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001164",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "45316f0d-e11e-48dd-aa7b-9f029d134d1d",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001475",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "fe37eb59-e816-4cfc-b9d9-244ccb59b8ee",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001848",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "ff816bea-4f17-4d13-9285-66516d266d86",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0000102",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "00c60051-3e9e-417c-92dc-51322df47618",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0000158",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "9020cacf-82e5-4127-b82f-03081916c694",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001056",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "114431bd-dbc7-43dd-95f4-4b36d256f7cd",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001164",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "6f71005b-fc55-45d8-a834-0ecf1189813a",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001475",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "d0b01bc3-fba4-4f7d-bc35-0dfcc763c7e5",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001848",
      "properties": {
        "mid_list": "tt0087277"
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_edges_1520854203.json
D3Util#__init__: tmp/query_edges_1520854203.json
