function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: knows
query: g.V('nm0001742').out('knows')
--- result_below ---
{
  "qname": "knows",
  "query": "g.V('nm0001742').out('knows')",
  "result_count": 6,
  "result": [
    {
      "id": "nm0000102",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "ba749aff-7a72-429e-8bf7-ff40c73e2e18",
            "value": "Kevin Bacon"
          }
        ]
      }
    },
    {
      "id": "nm0000158",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "09eaa3fb-3143-44ba-8d18-823589dcbd9b",
            "value": "Tom Hanks"
          }
        ]
      }
    },
    {
      "id": "nm0001056",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "117c15bb-05bf-466a-b2eb-64ec979b2607",
            "value": "Dabney Coleman"
          }
        ]
      }
    },
    {
      "id": "nm0001164",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "1ff6967a-6bb1-41b4-b606-1d5505b30738",
            "value": "Charles Durning"
          }
        ]
      }
    },
    {
      "id": "nm0001475",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "3fd48ef2-7a64-471b-b9c2-e1e879e5e830",
            "value": "John Lithgow"
          }
        ]
      }
    },
    {
      "id": "nm0001848",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "633548da-f317-43c0-8482-0818bef26266",
            "value": "Dianne Wiest"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_knows_1520854228.json
D3Util#__init__: tmp/query_knows_1520854228.json
