function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: edges
query: g.V(['n41','nm0001742']).bothE()
--- result_below ---
<gremlin_python.driver.resultset.ResultSet object at 0x10560a978>
{
  "qname": "edges",
  "query": "g.V(['n41','nm0001742']).bothE()",
  "result": [
    {
      "id": "b3ee63a1-7d1b-4c4c-a7e2-924eb49ab919",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0087277",
      "outV": "nm0001742",
      "properties": {
        "title": "Footloose"
      }
    },
    {
      "id": "52e5d29d-2baa-44fc-8fec-3ae2fc46f980",
      "label": "in",
      "type": "edge",
      "inVLabel": "movie",
      "outVLabel": "person",
      "inV": "tt0089543",
      "outV": "nm0001742",
      "properties": {
        "title": "The Man with One Red Shoe"
      }
    },
    {
      "id": "87f2f9b1-5af7-4a9e-9763-fde9e0f7d5f5",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000102",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "dacb1cdb-edb9-4efd-9daf-59379bdae276",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0000158",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "f68b2afd-7270-472f-801c-e919614b63c6",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001056",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "af95f89b-2107-4515-8db5-cfcf72e1f78d",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001164",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "e8c9e843-13b7-4578-a85e-7ad0d6cad834",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001475",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "b7e33c18-1806-48a4-8a98-9e6c9a9dadab",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001848",
      "outV": "nm0001742",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "91dc19e1-615c-42f1-85a1-b5d48d529d1e",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001848",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "e75c9b55-d690-4a18-80cd-927a7087674f",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0000158",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "2e56be3c-ee02-4d42-abe2-c847e8d83bc2",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001056",
      "properties": {
        "mid_list": "tt0089543"
      }
    },
    {
      "id": "8e92b02e-2a05-4921-b24b-b88d81ed5056",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001475",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "fc36c38d-c420-4a13-8561-3124a71cbe69",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0000102",
      "properties": {
        "mid_list": "tt0087277"
      }
    },
    {
      "id": "018bd26b-6351-45ac-8264-5e1de6ba6268",
      "label": "knows",
      "type": "edge",
      "inVLabel": "person",
      "outVLabel": "person",
      "inV": "nm0001742",
      "outV": "nm0001164",
      "properties": {
        "mid_list": "tt0089543"
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_edges_1521022681.json
D3Util#__init__: tmp/query_edges_1521022681.json
