function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: knows
query: g.V(['n41','nm0001742']).out('knows')
--- result_below ---
<gremlin_python.driver.resultset.ResultSet object at 0x1112bf978>
{
  "qname": "knows",
  "query": "g.V(['n41','nm0001742']).out('knows')",
  "result": [
    {
      "id": "nm0000102",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000102|pk",
            "value": "n10"
          }
        ],
        "name": [
          {
            "id": "c48051a9-c722-48f0-abbe-1f3ccf122b14",
            "value": "Kevin Bacon"
          }
        ]
      }
    },
    {
      "id": "nm0000158",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0000158|pk",
            "value": "n12"
          }
        ],
        "name": [
          {
            "id": "551644a9-df4e-4625-86b6-fd95fded6960",
            "value": "Tom Hanks"
          }
        ]
      }
    },
    {
      "id": "nm0001056",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0001056|pk",
            "value": "n32"
          }
        ],
        "name": [
          {
            "id": "d83b3f6c-c5cc-45fc-b629-c343965ade7b",
            "value": "Dabney Coleman"
          }
        ]
      }
    },
    {
      "id": "nm0001164",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0001164|pk",
            "value": "n34"
          }
        ],
        "name": [
          {
            "id": "bb0f046b-0f48-416e-8af9-99853e3caf76",
            "value": "Charles Durning"
          }
        ]
      }
    },
    {
      "id": "nm0001475",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0001475|pk",
            "value": "n38"
          }
        ],
        "name": [
          {
            "id": "5a9eaecd-b42e-40a6-86fa-b5a39310473d",
            "value": "John Lithgow"
          }
        ]
      }
    },
    {
      "id": "nm0001848",
      "label": "person",
      "type": "vertex",
      "properties": {
        "pk": [
          {
            "id": "nm0001848|pk",
            "value": "n42"
          }
        ],
        "name": [
          {
            "id": "066a9a7e-461d-4412-96bf-1f30d42ceec4",
            "value": "Dianne Wiest"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_knows_1521022697.json
D3Util#__init__: tmp/query_knows_1521022697.json
