function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: in
query: g.V('nm0001742').out('in')
--- result_below ---
{
  "qname": "in",
  "query": "g.V('nm0001742').out('in')",
  "result_count": 2,
  "result": [
    {
      "id": "tt0087277",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "50386697-2885-43e8-a9d3-d43a48c646dc",
            "value": "Footloose"
          }
        ]
      }
    },
    {
      "id": "tt0089543",
      "label": "movie",
      "type": "vertex",
      "properties": {
        "title": [
          {
            "id": "417da12c-14bf-4a09-9c27-aa14d8d08914",
            "value": "The Man with One Red Shoe"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_in_1520854172.json
D3Util#__init__: tmp/query_in_1520854172.json
