function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: path
query: g.V(['n41','nm0001742']).repeat(out().simplePath()).until(hasId('nm0001648')).path().limit(3)
--- result_below ---
{
  "qname": "path",
  "query": "g.V(['n41','nm0001742']).repeat(out().simplePath()).until(hasId('nm0001648')).path().limit(3)",
  "id1": "nm0001742",
  "pk1": "n41",
  "result_count": 3,
  "result": [
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001742|pk",
                "value": "n41"
              }
            ],
            "name": [
              {
                "id": "626f4005-1788-41a1-af69-dc093ac7efc5",
                "value": "Lori Singer"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000102|pk",
                "value": "n10"
              }
            ],
            "name": [
              {
                "id": "c48051a9-c722-48f0-abbe-1f3ccf122b14",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm2225369",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm2225369|pk",
                "value": "n1491"
              }
            ],
            "name": [
              {
                "id": "1eb88015-5614-4758-978f-9904ca350944",
                "value": "Jennifer Lawrence"
              }
            ]
          }
        },
        {
          "id": "nm0001648",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001648|pk",
                "value": "n40"
              }
            ],
            "name": [
              {
                "id": "3d87f3bc-fd6a-4e18-8261-b4d1f2b0bd5d",
                "value": "Charlotte Rampling"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001742|pk",
                "value": "n41"
              }
            ],
            "name": [
              {
                "id": "626f4005-1788-41a1-af69-dc093ac7efc5",
                "value": "Lori Singer"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000102|pk",
                "value": "n10"
              }
            ],
            "name": [
              {
                "id": "c48051a9-c722-48f0-abbe-1f3ccf122b14",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm0000134",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000134|pk",
                "value": "n11"
              }
            ],
            "name": [
              {
                "id": "de4cc98a-d436-4cf5-816b-136177d8ad78",
                "value": "Robert De Niro"
              }
            ]
          }
        },
        {
          "id": "nm2225369",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm2225369|pk",
                "value": "n1491"
              }
            ],
            "name": [
              {
                "id": "1eb88015-5614-4758-978f-9904ca350944",
                "value": "Jennifer Lawrence"
              }
            ]
          }
        },
        {
          "id": "nm0001648",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001648|pk",
                "value": "n40"
              }
            ],
            "name": [
              {
                "id": "3d87f3bc-fd6a-4e18-8261-b4d1f2b0bd5d",
                "value": "Charlotte Rampling"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001742|pk",
                "value": "n41"
              }
            ],
            "name": [
              {
                "id": "626f4005-1788-41a1-af69-dc093ac7efc5",
                "value": "Lori Singer"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000102|pk",
                "value": "n10"
              }
            ],
            "name": [
              {
                "id": "c48051a9-c722-48f0-abbe-1f3ccf122b14",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm0000223",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000223|pk",
                "value": "n14"
              }
            ],
            "name": [
              {
                "id": "9b02848d-4c36-474d-ad62-7f71f73bb03e",
                "value": "Elisabeth Shue"
              }
            ]
          }
        },
        {
          "id": "nm2225369",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm2225369|pk",
                "value": "n1491"
              }
            ],
            "name": [
              {
                "id": "1eb88015-5614-4758-978f-9904ca350944",
                "value": "Jennifer Lawrence"
              }
            ]
          }
        },
        {
          "id": "nm0001648",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001648|pk",
                "value": "n40"
              }
            ],
            "name": [
              {
                "id": "3d87f3bc-fd6a-4e18-8261-b4d1f2b0bd5d",
                "value": "Charlotte Rampling"
              }
            ]
          }
        }
      ]
    }
  ]
}
--- result_above ---
file written: tmp/query_path_1521024741.json
D3Util#__init__: tmp/query_path_1521024741.json
file written: d3/graph.json
