function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: path
query: g.V(['n12','nm0000152']).repeat(out().simplePath()).until(hasId('nm0001742')).path().limit(3)
--- result_below ---
{
  "qname": "path",
  "query": "g.V(['n12','nm0000152']).repeat(out().simplePath()).until(hasId('nm0001742')).path().limit(3)",
  "id1": "nm0000152",
  "pk1": "n12",
  "result_count": 3,
  "result": [
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000152|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "069b03ee-c460-4c42-be40-0a39470c6106",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000166",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000166|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "ae9e5026-a0f0-4710-a9e8-dba350088850",
                "value": "Helen Hunt"
              }
            ]
          }
        },
        {
          "id": "nm0000158",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000158|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "551644a9-df4e-4625-86b6-fd95fded6960",
                "value": "Tom Hanks"
              }
            ]
          }
        },
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001742|pk",
                "value": "n41"
              }
            ],
            "name": [
              {
                "id": "626f4005-1788-41a1-af69-dc093ac7efc5",
                "value": "Lori Singer"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000152|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "069b03ee-c460-4c42-be40-0a39470c6106",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000178",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000178|pk",
                "value": "n13"
              }
            ],
            "name": [
              {
                "id": "e77785e7-7686-4062-96b5-090e40634fc9",
                "value": "Diane Lane"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000102|pk",
                "value": "n10"
              }
            ],
            "name": [
              {
                "id": "c48051a9-c722-48f0-abbe-1f3ccf122b14",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001742|pk",
                "value": "n41"
              }
            ],
            "name": [
              {
                "id": "626f4005-1788-41a1-af69-dc093ac7efc5",
                "value": "Lori Singer"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000152|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "069b03ee-c460-4c42-be40-0a39470c6106",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000191",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000191|pk",
                "value": "n13"
              }
            ],
            "name": [
              {
                "id": "6b997c60-4578-45be-8d07-90cddb4f080f",
                "value": "Ewan McGregor"
              }
            ]
          }
        },
        {
          "id": "nm0000158",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000158|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "551644a9-df4e-4625-86b6-fd95fded6960",
                "value": "Tom Hanks"
              }
            ]
          }
        },
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001742|pk",
                "value": "n41"
              }
            ],
            "name": [
              {
                "id": "626f4005-1788-41a1-af69-dc093ac7efc5",
                "value": "Lori Singer"
              }
            ]
          }
        }
      ]
    }
  ]
}
--- result_above ---
file written: tmp/query_path_1521024723.json
D3Util#__init__: tmp/query_path_1521024723.json
file written: d3/graph.json
