function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: path
query: g.V(['n41','nm0001742']).repeat(out().simplePath()).until(hasId('nm0205626')).path().limit(3)
--- result_below ---
{
  "qname": "path",
  "query": "g.V(['n41','nm0001742']).repeat(out().simplePath()).until(hasId('nm0205626')).path().limit(3)",
  "id1": "nm0001742",
  "pk1": "n41",
  "result_count": 3,
  "result": [
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001742|pk",
                "value": "n41"
              }
            ],
            "name": [
              {
                "id": "626f4005-1788-41a1-af69-dc093ac7efc5",
                "value": "Lori Singer"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000102|pk",
                "value": "n10"
              }
            ],
            "name": [
              {
                "id": "c48051a9-c722-48f0-abbe-1f3ccf122b14",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm0000178",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000178|pk",
                "value": "n13"
              }
            ],
            "name": [
              {
                "id": "e77785e7-7686-4062-96b5-090e40634fc9",
                "value": "Diane Lane"
              }
            ]
          }
        },
        {
          "id": "nm0205626",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0205626|pk",
                "value": "n453"
              }
            ],
            "name": [
              {
                "id": "b30a2f31-9513-4236-a0c7-2cbaf777334c",
                "value": "Viola Davis"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001742|pk",
                "value": "n41"
              }
            ],
            "name": [
              {
                "id": "626f4005-1788-41a1-af69-dc093ac7efc5",
                "value": "Lori Singer"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000102|pk",
                "value": "n10"
              }
            ],
            "name": [
              {
                "id": "c48051a9-c722-48f0-abbe-1f3ccf122b14",
                "value": "Kevin Bacon"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000210|pk",
                "value": "n14"
              }
            ],
            "name": [
              {
                "id": "a3681a09-4e36-4435-bc99-8e4d7dfd855e",
                "value": "Julia Roberts"
              }
            ]
          }
        },
        {
          "id": "nm0205626",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0205626|pk",
                "value": "n453"
              }
            ],
            "name": [
              {
                "id": "b30a2f31-9513-4236-a0c7-2cbaf777334c",
                "value": "Viola Davis"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0001742",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0001742|pk",
                "value": "n41"
              }
            ],
            "name": [
              {
                "id": "626f4005-1788-41a1-af69-dc093ac7efc5",
                "value": "Lori Singer"
              }
            ]
          }
        },
        {
          "id": "nm0000158",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000158|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "551644a9-df4e-4625-86b6-fd95fded6960",
                "value": "Tom Hanks"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000210|pk",
                "value": "n14"
              }
            ],
            "name": [
              {
                "id": "a3681a09-4e36-4435-bc99-8e4d7dfd855e",
                "value": "Julia Roberts"
              }
            ]
          }
        },
        {
          "id": "nm0205626",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0205626|pk",
                "value": "n453"
              }
            ],
            "name": [
              {
                "id": "b30a2f31-9513-4236-a0c7-2cbaf777334c",
                "value": "Viola Davis"
              }
            ]
          }
        }
      ]
    }
  ]
}
--- result_above ---
file written: tmp/query_path_1521024732.json
D3Util#__init__: tmp/query_path_1521024732.json
file written: d3/graph.json
