function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: path
query: g.V('nm0000152').repeat(out().simplePath()).until(hasId('nm0000102')).path().limit(3)
--- result_below ---
{
  "qname": "path",
  "query": "g.V('nm0000152').repeat(out().simplePath()).until(hasId('nm0000102')).path().limit(3)",
  "result_count": 3,
  "result": [
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "4fd27782-4206-4eda-a04b-4fadbd35a71e",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000178",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "00c20d60-3a19-4ee6-8764-d57b907e2ae9",
                "value": "Diane Lane"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "ba749aff-7a72-429e-8bf7-ff40c73e2e18",
                "value": "Kevin Bacon"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "4fd27782-4206-4eda-a04b-4fadbd35a71e",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "81601c6f-7eae-4c84-bed2-e36b593f9b89",
                "value": "Julia Roberts"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "ba749aff-7a72-429e-8bf7-ff40c73e2e18",
                "value": "Kevin Bacon"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "4fd27782-4206-4eda-a04b-4fadbd35a71e",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000250",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "e34a68bb-096f-4910-a681-fd48f0c7f56f",
                "value": "Ren\u00e9e Zellweger"
              }
            ]
          }
        },
        {
          "id": "nm0000102",
          "label": "person",
          "type": "vertex",
          "properties": {
            "name": [
              {
                "id": "ba749aff-7a72-429e-8bf7-ff40c73e2e18",
                "value": "Kevin Bacon"
              }
            ]
          }
        }
      ]
    }
  ]
}
--- result_above ---
file written: tmp/query_path_1520854248.json
D3Util#__init__: tmp/query_path_1520854248.json
file written: d3/graph.json
