function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: path
query: g.V(['n12','nm0000152']).repeat(out().simplePath()).until(hasId('nm0000210')).path().limit(3)
--- result_below ---
<gremlin_python.driver.resultset.ResultSet object at 0x10ceff9b0>
{
  "qname": "path",
  "query": "g.V(['n12','nm0000152']).repeat(out().simplePath()).until(hasId('nm0000210')).path().limit(3)",
  "result": [
    {
      "labels": [
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000152|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "069b03ee-c460-4c42-be40-0a39470c6106",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000210|pk",
                "value": "n14"
              }
            ],
            "name": [
              {
                "id": "a3681a09-4e36-4435-bc99-8e4d7dfd855e",
                "value": "Julia Roberts"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000152|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "069b03ee-c460-4c42-be40-0a39470c6106",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000114",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000114|pk",
                "value": "n10"
              }
            ],
            "name": [
              {
                "id": "7b2de26d-1cde-466a-8f6b-52e691f35ee0",
                "value": "Steve Buscemi"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000210|pk",
                "value": "n14"
              }
            ],
            "name": [
              {
                "id": "a3681a09-4e36-4435-bc99-8e4d7dfd855e",
                "value": "Julia Roberts"
              }
            ]
          }
        }
      ]
    },
    {
      "labels": [
        [],
        [],
        []
      ],
      "objects": [
        {
          "id": "nm0000152",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000152|pk",
                "value": "n12"
              }
            ],
            "name": [
              {
                "id": "069b03ee-c460-4c42-be40-0a39470c6106",
                "value": "Richard Gere"
              }
            ]
          }
        },
        {
          "id": "nm0000215",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000215|pk",
                "value": "n14"
              }
            ],
            "name": [
              {
                "id": "744532bc-5e05-4ec9-8b9c-c3b74885cc21",
                "value": "Susan Sarandon"
              }
            ]
          }
        },
        {
          "id": "nm0000210",
          "label": "person",
          "type": "vertex",
          "properties": {
            "pk": [
              {
                "id": "nm0000210|pk",
                "value": "n14"
              }
            ],
            "name": [
              {
                "id": "a3681a09-4e36-4435-bc99-8e4d7dfd855e",
                "value": "Julia Roberts"
              }
            ]
          }
        }
      ]
    }
  ]
}
--- result_above ---
file written: tmp/query_path_1521022702.json
D3Util#__init__: tmp/query_path_1521022702.json
file written: d3/graph.json
