function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: person
query: g.V().has('label','person').has('id','nm0000102')
--- result_below ---
{
  "qname": "person",
  "query": "g.V().has('label','person').has('id','nm0000102')",
  "result_count": 1,
  "result": [
    {
      "id": "nm0000102",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "ba749aff-7a72-429e-8bf7-ff40c73e2e18",
            "value": "Kevin Bacon"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_person_1520854123.json
D3Util#__init__: tmp/query_person_1520854123.json
