function: query
create_client:
endpoint: wss://cjoakim-cosmosdb-gremlin.gremlin.cosmosdb.azure.com:443/
username: /dbs/dev/colls/movies
qname: person
query: g.V().has('label','person').has('id','nm0000210')
--- result_below ---
{
  "qname": "person",
  "query": "g.V().has('label','person').has('id','nm0000210')",
  "result_count": 1,
  "result": [
    {
      "id": "nm0000210",
      "label": "person",
      "type": "vertex",
      "properties": {
        "name": [
          {
            "id": "81601c6f-7eae-4c84-bed2-e36b593f9b89",
            "value": "Julia Roberts"
          }
        ]
      }
    }
  ]
}
--- result_above ---
file written: tmp/query_person_1520854135.json
D3Util#__init__: tmp/query_person_1520854135.json
